---
type: IDataConversionMonitor
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# IDataConversionMonitor

`Autodesk.Revit.DB.IDataConversionMonitor` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVerbosity | 2016 | `DataExchangeMessageVerbosity GetVerbosity ()` |
| Method | ProcessMessage | 2016 | `bool ProcessMessage ( DataExchangeMessageId messageId , DataExchangeMessageSeverity messageSeverity , IList < string > entityIds )` |